efogdev/esp32-s3-efogtech-iskra/main/main.c
static void toggleCooling() {
    isCooling = !isCooling;

    if (isCooling) {
        startCooling();
    } else {
        stopCooling();
    }
}

static void setPeltierValue(int value) {
    peltierValue = value;
}

static void setFanValue(int value) {
    fanValue = value;
}

static void initPwm() {
    ledc_timer_config_t ledc_timer = {
        .speed_mode       = PWM_MODE,
        .timer_num        = LEDC_TIMER_0, 
        .duty_resolution  = PWM_RESOLUTION,
        .freq_hz          = PWM_FREQ,
        .clk_cfg          = LEDC_AUTO_CLK
    };
    ESP_ERROR_CHECK(ledc_timer_config(&ledc_timer));

    ledc_timer_config_t ledc_timer2 = {
        .duty_resolution = RGB_RESOLUTION, 
        .freq_hz = RGB_FREQ,               
        .speed_mode = PWM_MODE,           
        .timer_num = LEDC_TIMER_1,        
        .clk_cfg = LEDC_AUTO_CLK,         
    };
    ledc_timer_config(&ledc_timer2);

    ledc_channel_config_t ledc_heat = {
        .speed_mode     = PWM_MODE,
        .channel        = PWM_CHANNEL_HEAT,
        .timer_sel      = LEDC_TIMER_0,
        .intr_type      = LEDC_INTR_DISABLE,
        .gpio_num       = GPIO_HEAT,
        .duty           = 0, 
        .hpoint         = 0
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ledc_heat));

    ledc_channel_config_t ledc_rgb_r = {
        .channel    = RGB_CHANNEL_R,
        .duty       = 0,
        .gpio_num   = GPIO_RGB_R,
        .speed_mode = PWM_MODE,
        .hpoint     = 0,
        .timer_sel  = LEDC_TIMER_1,
        .flags.output_invert = 0
    };

    ledc_channel_config_t ledc_rgb_g = {
        .channel    = RGB_CHANNEL_G,
        .duty       = 0,
        .gpio_num   = GPIO_RGB_G,
        .speed_mode = PWM_MODE,
        .hpoint     = 0,
        .timer_sel  = LEDC_TIMER_1,
        .flags.output_invert = 0
    };

    ledc_channel_config_t ledc_rgb_b = {
        .channel    = RGB_CHANNEL_B,
        .duty       = 0,
        .gpio_num   = GPIO_RGB_B,
        .speed_mode = PWM_MODE,
        .hpoint     = 0,
        .timer_sel  = LEDC_TIMER_1,
        .flags.output_invert = 0
    };

    ESP_ERROR_CHECK(ledc_channel_config(&ledc_rgb_r));
    ESP_ERROR_CHECK(ledc_channel_config(&ledc_rgb_g));
    ESP_ERROR_CHECK(ledc_channel_config(&ledc_rgb_b));
}

static void initAdc() {
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(10, 50);
    ESP_ERROR_CHECK(temperature_sensor_install(&temp_sensor_config, &temp_sensor));

    ESP_LOGI(TAG, "Enable temperature sensor");
    ESP_ERROR_CHECK(temperature_sensor_enable(temp_sensor));

    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = ADC_UNIT_1,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc1_handle));

    adc_oneshot_unit_init_cfg_t init_config2 = {
            .unit_id = ADC_UNIT_2,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config2, &adc2_handle));

    adc_oneshot_chan_cfg_t config = {
        .bitwidth = ADC_BITWIDTH_12,
        .atten = ADC_ATTEN_DB_11,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, USB_VREF_ADC_CHANNEL, &config));
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc2_handle, TEMP_ADC_CHANNEL, &config));
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, RADIATOR_TEMP_ADC_CHANNEL, &config));

    adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = ADC_UNIT_1,
            .atten = ADC_ATTEN_DB_11,
            .bitwidth = ADC_BITWIDTH_12,
    };
    ESP_ERROR_CHECK(adc_cali_create_scheme_curve_fitting(&cali_config, &adc_cali_handle));

    adc_cali_curve_fitting_config_t cali2_config = {
            .unit_id = ADC_UNIT_2,
            .atten = ADC_ATTEN_DB_11,
            .bitwidth = ADC_BITWIDTH_12,
    };
    ESP_ERROR_CHECK(adc_cali_create_scheme_curve_fitting(&cali2_config, &adc_cali_handle));

    makeAdcReads();
}

static volatile int averageVoltageRaw;
static volatile bool voltageWarning = false;
static volatile int vbuffer_index = 0;
#define vbuffer_size 16
static volatile int voltageBuffer[vbuffer_size];
static void makeAdcReads() {
    int sum_1 = 0, sum_2 = 0, sum_3 = 0, sum_4 = 0;
    int8_t multisample = 32;

    for (int8_t i = 0; i < multisample; i++) {
        int temp_1 = 0, temp_2 = 0, temp_3 = 0;
        float temp_4 = 0;

        adc_oneshot_read(adc1_handle, USB_VREF_ADC_CHANNEL, &temp_1);
        adc_oneshot_read(adc2_handle, TEMP_ADC_CHANNEL, &temp_2);
        adc_oneshot_read(adc1_handle, RADIATOR_TEMP_ADC_CHANNEL, &temp_3);
        temperature_sensor_get_celsius(temp_sensor, &temp_4);

        sum_1 += temp_1;
        sum_2 += temp_2;
        sum_3 += temp_3;
        sum_4 += (signed int) temp_4;
    }

    freeRam = esp_get_free_heap_size();

    usbVrefVoltage = sum_1 / multisample;
    heaterTemperature = (sum_2 / multisample) * 0.95;
    waterTemperature = sum_3 / multisample;
    boardTemperature = sum_4 / multisample;

    int usbCalibrated = 0;
    adc_cali_raw_to_voltage(adc_cali_handle, usbVrefVoltage, &usbCalibrated);

    int volts = (usbCalibrated * (10000 + 1000) / 1000) / 1000;
    int mV = ((usbCalibrated * (10000 + 1000) / 1000) % 1000) / 100;

    sprintf(voltageString, "%d.%dV", volts, mV);

    usbVrefVoltageValue = usbCalibrated;

    if (vbuffer_index >= vbuffer_size) {
        vbuffer_index = 0;
    }

    voltageBuffer[vbuffer_index] = usbCalibrated;

    ws_update_voltage(usbVrefVoltage);
    ws_update_temperature(heaterTemperature);

    vbuffer_index++;
}

extern const char root_start[] asm("_binary_index_html_start");
extern const char root_end[] asm("_binary_index_html_end");

extern const char manifest_start[] asm("_binary_manifest_json_start");
extern const char manifest_end[] asm("_binary_manifest_json_end");

extern const char ota_start[] asm("_binary_upload_html_start");
extern const char ota_end[] asm("_binary_upload_html_end");

extern const char bundle_start[] asm("_binary_bundle_js_start");
extern const char bundle_end[] asm("_binary_bundle_js_end");

extern const char sw_start[] asm("_binary_sw_js_start");
extern const char sw_end[] asm("_binary_sw_js_end");

static esp_err_t root_get_handler(httpd_req_t *req)
{
    const uint32_t root_len = root_end - root_start;

