efogdev/esp32-s3-efogtech-iskra/main/main.c
    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, root_start, root_len);

    return ESP_OK;
}

static esp_err_t sw_get_handler(httpd_req_t *req)
{
    const uint32_t sw_len = sw_end - sw_start;

    httpd_resp_set_type(req, "text/javascript");
    httpd_resp_send(req, sw_start, sw_len);

    return ESP_OK;
}

static esp_err_t bundle_get_handler(httpd_req_t *req)
{
    const uint32_t bundle_len = bundle_end - bundle_start;

    httpd_resp_set_type(req, "text/javascript");
    httpd_resp_send(req, bundle_start, bundle_len);

    return ESP_OK;
}

static esp_err_t manifest_get_handler(httpd_req_t *req)
{
    const uint32_t manifest_len = manifest_end - manifest_start;

    httpd_resp_set_type(req, "application/json");
    httpd_resp_send(req, manifest_start, manifest_len);

    return ESP_OK;
}

static esp_err_t ota_get_handler(httpd_req_t *req)
{
    const uint32_t ota_len = ota_end - ota_start;

    httpd_resp_set_type(req, "text/html");
    httpd_resp_send(req, ota_start, ota_len);

    return ESP_OK;
}

static const httpd_uri_t root = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = root_get_handler,
    .user_ctx = NULL
};

static const httpd_uri_t ota = {
     .uri = "/ota",
     .method = HTTP_GET,
     .handler = ota_get_handler,
     .user_ctx = NULL
};

static const httpd_uri_t manifest = {
     .uri = "/manifest.json",
     .method = HTTP_GET,
     .handler = manifest_get_handler,
     .user_ctx = NULL
};

static const httpd_uri_t bundle = {
     .uri = "/bundle.js",
     .method = HTTP_GET,
     .handler = bundle_get_handler,
     .user_ctx = NULL
};

static const httpd_uri_t sw = {
     .uri = "/sw.js",
     .method = HTTP_GET,
     .handler = sw_get_handler,
     .user_ctx = NULL
};

esp_err_t http_404_error_handler(httpd_req_t *req, httpd_err_code_t err)
{
    httpd_resp_set_status(req, "302 Temporary Redirect");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_send(req, "Redirect to the captive portal", HTTPD_RESP_USE_STRLEN);

    return ESP_OK;
}

static httpd_handle_t start_webserver(void)
{
    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    config.task_priority = 2;
    config.server_port = 80;
    config.backlog_conn = 0;
    config.max_open_sockets = 12;
    config.max_uri_handlers = 12;
    config.lru_purge_enable = true;
    config.keep_alive_enable = false;
    config.send_wait_timeout = 3;
    config.uri_match_fn = httpd_uri_match_wildcard;

    ESP_LOGI(TAG, "Starting server on port: '%d'", config.server_port);
    if (httpd_start(&server, &config) == ESP_OK) {
        start_dns_server(dns_task_handle);

        httpd_register_uri_handler(server, &ota);
        httpd_register_uri_handler(server, &manifest);
        httpd_register_uri_handler(server, &bundle);
        httpd_register_uri_handler(server, &sw);
        httpd_register_uri_handler(server, &root);

        initWebsocket(server);
        start_file_server(server);

        httpd_register_err_handler(server, HTTPD_404_NOT_FOUND, http_404_error_handler);
    } else {
        esp_restart();
    }

    return server;
}

static void rgb_set(int r, int g, int b) {
    ledc_set_duty(PWM_MODE, RGB_CHANNEL_R, r);
    ledc_update_duty(PWM_MODE, RGB_CHANNEL_R);

    ledc_set_duty(PWM_MODE, RGB_CHANNEL_G, g);
    ledc_update_duty(PWM_MODE, RGB_CHANNEL_G);

    ledc_set_duty(PWM_MODE, RGB_CHANNEL_B, b);
    ledc_update_duty(PWM_MODE, RGB_CHANNEL_B);
}

static void rgb_task(void *pvParameters)
{
    rgb_clean();

    while (1) {
        gpio_set_level(GPIO_NUM_LED_HEAT, heaterTemperatureC > 120);

        if (usbVrefVoltage < voltageThreshold) {
            rgb_set(0, 0, 0);
            vTaskDelay(pdMS_TO_TICKS(128));
            continue;
        }

        rgb_tick();
        vTaskDelay(pdMS_TO_TICKS(16));
    }
}

static void call_911_task(void *pvParameters) {
    while (1) {
//        if (heaterTemperatureC > targetTemperature + 20) {
//            isHeating = 0;
//            targetTemperature = 0;
//            heaterPwm = 0;
//            stopHeating();
//        }
//
//        if (boardTemperature > 75) {
//            esp_system_abort("OVERHEAT");
//        }
//
//        if (heaterTemperatureC > 400) {
//            esp_restart();
//        }
//
        vTaskDelay(pdMS_TO_TICKS(32));
    }
}

static void pd_task(void *pvParameters) {
    int actualValue = 0;

    gpio_set_level(GPIO_NUM_PD_CFG2, 1);
    gpio_set_level(GPIO_NUM_PD_CFG3, 1);

    nvs_handle_t nvs;
    nvs_open("storage", NVS_READWRITE, &nvs);

    uint8_t isPdTested;
    nvs_get_u8(nvs, "pd_tested", &isPdTested);

    if (isPdTested == 1) {
        isPDTesting = false;

        uint8_t vcc12, vcc15, vcc20;
        nvs_get_u8(nvs, "vcc12", &vcc12);
        nvs_get_u8(nvs, "vcc15", &vcc15);
        nvs_get_u8(nvs, "vcc20", &vcc20);

        if (vcc12 == 1)
            pdCapable12 = true;

        if (vcc15 == 1)
            pdCapable15 = true;

        if (vcc20 == 1)
            pdCapable20 = true;

        if (pdCapable15)
            setPD(15);
    } else {
        isPDTesting = true;
    }

    nvs_set_u8(nvs, "pd_tested", 0);

    while (1) {
        if (usbVrefVoltage < voltageThreshold) {
            disable_all();
        }

        if (isPDTesting && (usbVrefVoltage > voltageThreshold)) {
            setThinking(REASON_TEST, true);
            disable_all();
            vTaskDelay(pdMS_TO_TICKS(120));

            nvs_set_u8(nvs, "vcc12", 0);
            nvs_set_u8(nvs, "vcc15", 0);
            nvs_set_u8(nvs, "vcc20", 0);
            nvs_set_u8(nvs, "pd_tested", 1);

            ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, PWM_MAX * 0.8);
            ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);

            gpio_set_level(GPIO_NUM_PD_CFG2, 0);
            gpio_set_level(GPIO_NUM_PD_CFG3, 1);
            vTaskDelay(pdMS_TO_TICKS(320));

            pdCapable12 = true;
            nvs_set_u8(nvs, "vcc12", 1);

            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 1);
            vTaskDelay(pdMS_TO_TICKS(320));

