efogdev/esp32-s3-efogtech-iskra/main/main.c
            pdCapable15 = true;
            nvs_set_u8(nvs, "vcc15", 1);

            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 0);
            vTaskDelay(pdMS_TO_TICKS(320));

            pdCapable20 = true;
            nvs_set_u8(nvs, "vcc20", 1);

            if (pdCapable15) {
                setPD(15);
            } else {
                setPD(12);
            }

            nvs_set_u8(nvs, "pd_tested", 0);
            setThinking(REASON_TEST, false);
            isPDTesting = false;

            continue;
        }

        if (vbuffer_index > 0) {
            int count = 0, sum = 0;
            for (int i = 0; i < vbuffer_index; i++) {
                int value = voltageBuffer[i];

                if (value > 0) {
                    count++;
                    sum += value;
                }
            }

            averageVoltageRaw = sum / count;
        }

        if (averageVoltageRaw > 0) {
            int percentChange = 100 - (usbVrefVoltageValue * 100 / averageVoltageRaw);

            if (percentChange < -5) {
                char text[64];
                sprintf(text, "Voltage peak? Vraw_avg: %d, Vraw: %d", averageVoltageRaw, usbVrefVoltageValue);
                ws_log(text);
            }

            if (percentChange > 5) {
                char text[64];
                sprintf(text, "Voltage drop! Vraw_avg = %d, Vraw = %d", averageVoltageRaw, usbVrefVoltageValue);
                ws_log(text);

                voltageWarning = true;

                if (isHeating) {
                    stopHeating();
                    vTaskDelay(pdMS_TO_TICKS(250));
                    startHeating();
                }

                vTaskDelay(pdMS_TO_TICKS(1400));
                voltageWarning = false;
            }
        }

        if (requestUsbPdVolts == actualValue) {
            vTaskDelay(pdMS_TO_TICKS(128));
            continue;
        }

        setThinking(REASON_PD, true);

        actualValue = requestUsbPdVolts;
        vTaskDelay(pdMS_TO_TICKS(12));

        // 0 1   12V
        // 1 1   15V
        // 1 0   20V

        if (requestUsbPdVolts == 12) {
            gpio_set_level(GPIO_NUM_PD_CFG2, 0);
            gpio_set_level(GPIO_NUM_PD_CFG3, 1);
        } else if (requestUsbPdVolts == 15) {
            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 1);
        } else if (requestUsbPdVolts == 20) {
            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 0);
        }

        vTaskDelay(pdMS_TO_TICKS(250));
        setThinking(REASON_PD, false);
    }
}

static void report_task(void *pvParameters) {
    while (1) {
        if (!webserver) {
            vTaskDelay(pdMS_TO_TICKS(360));
            continue;
        }

        vTaskDelay(pdMS_TO_TICKS(360));

        float ntcResistance = 5600 * (1 / (3.3 / ((3.3 * heaterTemperature) / 4096) - 1));

        float temperature;
        temperature = ntcResistance / 100000;
        temperature = log(temperature);
        temperature /= 3950;
        temperature += 1.0 / (25 + 273.15);
        temperature = 1.0 / temperature;
        temperature -= 273.15;

        heaterTemperatureC = temperature;

        if (!isPDTesting) {
            if (isHeating && (usbVrefVoltage > voltageThreshold)) {
                if (temperature < targetTemperature - 20) {
                    heaterPwm = PWM_MAX;
                    ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, PWM_MAX);
                    ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);
                } else if (temperature < targetTemperature - 10) {
                    heaterPwm = PWM_MAX * 0.9;
                    ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, PWM_MAX);
                    ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);
                } else if (temperature >= targetTemperature) {
                    heaterPwm = PWM_MAX * 0.5;

                    ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, PWM_MAX * 0.5);
                    ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);
                }
            } else {
                ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, 0);
                ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);

                heaterPwm = 0;
            }
        }

        char buf[640];
        sprintf(buf,
            "{\"type\":\"update\",\"content\":{\"isHeating\":%s,\"temperature\":\"%d\",\"coolingTemperature\":\"%d\",\"voltage\":\"%s\",\"isVoltageOk\":%s,\"isCooling\":%s,\"boardTemperature\":\"%d\",\"heaterPower\":\"%d\",\"coolerPower\":\"%d\",\"fanPower\":\"%d\",\"freeRam\":\"%d\",\"voltageRaw\":\"%d\",\"isServerThinking\":%s,\"12V\":%s,\"15V\":%s,\"20V\":%s}}",
            isHeating ? "true" : "false", // isHeating
            (int) temperature, // temperature, C
            (int) waterTemperature, // radiator temp ADC raw data
            voltageString, // voltage
            (!voltageWarning && (usbVrefVoltage > voltageThreshold)) ? "true" : "false", // isVoltageOk
            isCooling ? "true" : "false", // isCooling
            (int) boardTemperature, // board temp, C
            isHeating ? (int) (((float) heaterPwm / PWM_MAX) * 100) : 0, // heater %
            isCooling ? (int) (((float) peltierValue / PWM_MAX) * 100) : 0, // cooler %
            (int) (((float) fanValue / PWM_MAX) * 100), // fan %
            (int) freeRam / 1000, // free RAM, kb
            (int) usbVrefVoltage, // raw voltage data
            isThinking ? "true" : "false",
            pdCapable12 ? "true" : "false",
            pdCapable15 ? "true" : "false",
            pdCapable20 ? "true" : "false"
        );

        httpd_ws_frame_t pkt;
        memset(&pkt, 0, sizeof(httpd_ws_frame_t));
        pkt.payload = (uint8_t *) buf;
        pkt.type = HTTPD_WS_TYPE_TEXT;
        pkt.len = strlen(buf);

        ws_send_frame_to_all_clients(&pkt, webserver);

        makeAdcReads();
        vTaskDelay(pdMS_TO_TICKS(128));
    }
}

void app_main(void)
{
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = (
            (1ULL << GPIO_NUM_HEAT)
            | (1ULL << GPIO_NUM_PELTIER)
            | (1ULL << GPIO_NUM_RGB_R)
            | (1ULL << GPIO_NUM_RGB_G) 
            | (1ULL << GPIO_NUM_RGB_B)
            | (1ULL << GPIO_NUM_LED_0) 
            | (1ULL << GPIO_NUM_LED_1)
            | (1ULL << GPIO_NUM_LED_HEAT)
            | (1ULL << GPIO_NUM_FAN)
        );
    io_conf.pull_down_en = 1;
    io_conf.pull_up_en = 0;
    gpio_config(&io_conf);

    io_conf.pin_bit_mask = (
            (1ULL << GPIO_NUM_PD_CFG2)
            | (1ULL << GPIO_NUM_PD_CFG3)
        );
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 1;
    gpio_config(&io_conf);

    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = 1ULL << GPIO_NUM_USB_VREF;
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 0;
    gpio_config(&io_conf);

    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = (
        (1ULL << GPIO_NUM_TR) |
        (1ULL << GPIO_NUM_TR_WATER) |
        (1ULL << GPIO_NUM_TR_RADIATOR)
    );
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 1;
    gpio_config(&io_conf);

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    ESP_LOGI(TAG, "Init emergency");
    xTaskCreate(&call_911_task, "call_911_task", 2048, NULL, 1, NULL);

    ESP_LOGI(TAG, "Init ADC");
    initAdc();

    ESP_LOGI(TAG, "Init PWM");
    initPwm();

    ESP_LOGI(TAG, "Init PD");
    xTaskCreate(&pd_task, "pd_task", 2048, NULL, 4, NULL);

    ESP_LOGI(TAG, "Init RGB");
    rgb_init();
    xTaskCreate(&rgb_task, "rgb_task", 2048, NULL, 12, NULL);

    ESP_LOGI(TAG, "Init report service");
    xTaskCreate(&report_task, "report_task", 4096, NULL, 8, NULL);

    ESP_LOGI(TAG, "Init wireless");
    initWifi();

    ESP_LOGI(TAG, "Init server");
    webserver = start_webserver();
}
